RNN_ANSWER = 'Все перечисленное'
LOW_LEVEL_LIBRARY_ANSWER = 'cuDNN'
DECREASE_DIMENSION_ANSWER = 'Метод главных компонент'

NVIDIA_MAPPER = {'Email (cтоит указать почту, с которой регистрировались на DataFest)': 'email',
                 'Для какого типа данных можно использовать RNN?': 'rnn_question',
                 'Имя': 'name',
                 'Как называется низкоуровневая библиотека, содержащая реализации различных Deep Learning слоев на GPU?'
                  :'low_level_library_question',
                 'Какой метод помогает понижать размерность данных?': 'decrease_dimension_question',
                 'Компания ': 'company',
                 'Телефон (нужен, чтобы мы могли вас отыскать на фесте и вручить вам Jetson)': 'tel',
                 'Фамилия ': 'surname',
                 'Хочу подписаться на рассылки NVIDIA. Я смогу отписаться от рассылок в любой момент': 'want_to_subscribe',
                 'Я подтверждаю свое согласие на обработку компанией NVIDIA моих персональных данных, указанных в форме, в целях и пределах, установленных законодательством РФ о персональных данных в рамках о персональных данных в рамках проводимых мероприятий': 'agree'
                 }