############# TEXTS #############
# Start
TEXT_HELLO = 'Привет, как дела? Что делать будем?'

# Check registration status
TEXT_ENTER_EMAIL = 'Напишите свою почту, либо введите /skip, чтобы вернуться назад'
TEXT_SKIP_EMAIL = 'Хорошо, почту можно ввести в другой раз'
TEXT_EMAIL_NOT_OK = 'К сожалению, данного адреса не оказалось в списке инвайтов. Загляните в следующий раз 👀'
TEXT_EMAIL_OK = 'Поздравляю! Вы получили приглашение на Data Fest⁶! Проверьте свою почту, там должно быть письмо с кодом для авторизации.'

# Authorization
TEXT_AUTH_EMAIL_OK = 'Хорошо, теперь введите код, который был Вам выслан на данный email.'
TEXT_CODE_NOT_OK = 'Что-то пошло не так, попробуйте еще раз.'
TEXT_CODE_OK = 'Вы авторизовались, теперь Вы можете попробовать поучаствовать в розыгрыше мерчендайза или в "Рэндом Пиве".'
TEXT_EMAIL_USED_BY_OTHER_USER = 'Под таким email уже авторизован другой пользователь'
# Get news
TEXT_NEWS = "Тут можно подписаться на последние обновления, а также посмотреть последние новости феста. Подписка гарантирует получение уведомления о коде для авторизации."
TEXT_NEWS_SUBSCRIBED = "Подписка на новости в деле! 🔥"
TEXT_NEWS_UNSUBSCRIBED = "Вы отписались от новостей. 😢"

# ZAGLUSHKA
TEXT_NOT_READY_YET = "В разработке. Мы оповестим о запуске!"

TEXT_BYE = 'До следующей встречи!'

TEXT_AFTER_SUB = 'Thank for sub, bro.'

TEXT_SHOW_SCHEDULE = 'Выберите день.'

TEXT_NOT_ADMIN = 'Доступно только админам.'
TEXT_ENTER_BROADCAST = 'Введите сообщение или введите /cancel, чтобы вернуться назад.'
TEXT_BROADCAST_DONE = 'Готово.'
TEXT_CANCEL_BROADCASTING = 'Ну не надо, так не надо...'

TEXT_START_INVITE_REFRESH = 'Запущено обновление инвайтов.'
TEXT_REPORT_INVITE_COUNT = 'Инвайты обновлены, новых {}.'
TEXT_REPORT_NOTIFICATION_COUNT = 'Нотификации по инвайтам разосланы: {} штук.'
TEXT_REPORT_INVITE_REFRESH_ERROR = 'Ошибка обновления инвайтов.'
TEXT_INVITE_NOTIFICATION = 'Вы приглашены на датафест! Проверьте почту.'

TEXT_FULL_BACK = 'Ok, вернемся обратно в меню, что будем делать?'

TEXT_UNKNOWN_COMMAND = "Пожалуйста, воспользуйтесь кнопками."

############# BUTTONS #############
# Main menu
BUTTON_CHECK_REGISTRATION = 'Проверить статус регистрации'
BUTTON_AUTHORISATION = 'Авторизоваться'
BUTTON_SCHEDULE = 'Расписание феста'
BUTTON_NEWS = 'Новости феста'
BUTTON_SHOW_PATH = 'Как добраться / Карта'

BUTTON_PARTICIPATE_IN_RANDOM_PRIZE = 'Участвовать в розыгрыше призов'
BUTTON_RANDOM_BEER = 'Участвовать в random beer'

BUTTON_REFRESH_SCHEDULE = 'Обновить расписание'
BUTTON_SEND_INVITES = 'Разослать инвайты'
BUTTON_START_RANDOM_PRIZE = 'Запустить розыгрыш'
BUTTON_POST_NEWS = 'Запостить новость'

BUTTON_NEWS_SUBSCRIPTION = 'Подписаться на новости'
BUTTON_NEWS_UNSUBSCRIPTION = 'Отписаться от новостей'
BUTTON_GET_LAST_5_NEWS = 'Посмотреть новости'

BUTTON_REGISTRATION = 'Регистрация'

BUTTON_FULL_BACK = 'Назад'
BUTTON_10_MAY_SCHEDULE = 'Расписание на 10 мая'
BUTTON_11_MAY_SCHEDULE = 'Расписание на 11 мая'

BUTTON_CHECK_EMAIL = 'Проверить Email'
